erp3l/src/Catalogs/ТипыОтчетностиОДоговорахЕИС/ТипыОтчетностиОДоговорахЕИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОтчетностиОДоговорахЕИС</name>
  <comment>purchaseContractTypeCodeType</comment>
  <attributes>
    <name>НомерВОтчете</name>
    <comment>Если == 0, но не используем</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВОтчете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ТипыОтчетностиОДоговорахЕИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
Процедура ДобавитьОбновитьЭлемент(Код, НомерВОтчете, Наименование, НаименованиеВОтчете)
	Ссылка = Справочники.ТипыОтчетностиОДоговорахЕИС.НайтиПоКоду(Код);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		КатегорияОбъект = Ссылка.ПолучитьОбъект();
	Иначе
		КатегорияОбъект = Справочники.ТипыОтчетностиОДоговорахЕИС.СоздатьЭлемент();
		КатегорияОбъект.Код = Код;
	КонецЕсли;
	КатегорияОбъект.НомерВОтчете = НомерВОтчете;
	КатегорияОбъект.Наименование = Наименование;
	КатегорияОбъект.ПолноеНаименование = Наименование;
	КатегорияОбъект.НаименованиеВОтчете = НаименованиеВОтчете;
	КатегорияОбъект.Записать();
КонецПроцедуры

Процедура ЗаполнитьИзСхемыЕИСВерсия92() Экспорт
	ДобавитьОбновитьЭлемент(1, 1, НСтр("ru = 'Договора по результатам закупок'"),
		НСтр("ru = 'Заключенных по результатам закупки товаров, работ, услуг, в том числе об общей стоимости договоров, информация о которых не внесена в реестр договоров'"));
	ДобавитьОбновитьЭлемент(2, 2, НСтр("ru = 'Договора, заключенные заказчиком по результатам закупки у единственного поставщика (исполнителя, подрядчика)'"),
		НСтр("ru = 'Заключенных по результатам закупки у единственного поставщика (исполнителя, подрядчика)'"));
	ДобавитьОбновитьЭлемент(3, 0, НСтр("ru = 'Договора, заключенные заказчиком по результатам закупки, сведения о которой составляют государственную тайну или в отношении которой приняты решения Правительства Российской Федерации'"),
		"");
	ДобавитьОбновитьЭлемент(4, 0, НСтр("ru = 'Договоры, заключенные заказчиком по результатам закупки у субъектов малого и среднего предпринимательства'"),
		"");
	ДобавитьОбновитьЭлемент(5, 3, НСтр("ru = 'Договоры, заключенные заказчиком с единственным поставщиком (исполнителем, подрядчиком) по результатам несостоявшейся конкурентной закупки'"),
		НСтр("ru = 'Заключенных с единственным поставщиком (исполнителем, подрядчиком) по результатам конкурентной закупки, признанной несостоявшейся'"));
КонецПроцедуры


#КонецЕсли
